#Resource bundle for Othello game messages in Vietnamese.
#It contains key-value pairs for various UI elements, messages, and game-related information.
#This bundle is designed for localization and internationalization of the user interface in the Othello game application.
#Author: Dinh Thuy Nhat Vy
#Created on: 12/07/2023
gameTitle = C\u1edd L\u1eadt
language = Ng\u00f4n Ng\u1eef
instructions = Th\u1ec3 l\u1ec7 Tr\u00f2 ch\u01a1i
play = B\u1eaeT \u0110\u1ea6U
yes = C\u00f3
no = Kh\u00f4ng
exitGame = Tho\u00e1t Tr\u00f2 ch\u01a1i
exitGameQuestion = B\u1ea1n c\u00f3 ch\u1eafc b\u1ea1n mu\u1ed1n tho\u00e1t kh\u1ecfi tr\u00f2 ch\u01a1i hay kh\u00f4ng?
firstPlayer = Ng\u01b0\u1eddi ch\u01a1i 1
secondPlayer = Ng\u01b0\u1eddi ch\u01a1i 2
username = T\u00ean ng\u01b0\u1eddi ch\u01a1i
inputUsername = Vui l\u00f2ng nh\u1eadp t\u00ean ng\u01b0\u1eddi ch\u01a1i
botChoice = \u0110\u1ec3 s\u1eed d\u1ee5ng AI, vui l\u00f2ng nh\u1eadp "-N" cho AI b\u00ecnh th\u01b0\u1eddng, ho\u1eb7c "-S" cho AI th\u00f4ng minh.
chooseAvatar = Ch\u1ecdn h\u00ecnh \u0111\u1ea1i di\u1ec7n c\u1ee7a b\u1ea1n
next = TI\u1ebeP T\u1ee4C
usernameWarning = Xin vui l\u00f2ng nh\u1eadp t\u00ean ng\u01b0\u1eddi ch\u01a1i!
usernameWarnings = Xin vui l\u00f2ng nh\u1eadp t\u00ean c\u00e1c ng\u01b0\u1eddi ch\u01a1i!
naiveAI = AI b\u00ecnh th\u01b0\u1eddng
smartAI = AI th\u00f4ng minh
markBlack = (Qu\u00e2n \u0110en)
markWhite = (Qu\u00e2n Tr\u1eafng)
announcements = Th\u00f4ng b\u00e1o
currentPlayer = Ng\u01b0\u1eddi ch\u01a1i Hi\u1ec7n t\u1ea1i:
player = Ng\u01b0\u1eddi ch\u01a1i
placedDiscAnnouncement = \u0111\u00e3 \u0111\u1eb7t m\u1ed9t qu\u00e2n c\u1edd v\u00e0o v\u1ecb tr\u00ed s\u1ed1
row = (\u1edf h\u00e0ng s\u1ed1
col = v\u00e0 c\u1ed9t s\u1ed1
invalidMoveAnnouncement = l\u00e0 m\u1ed9t n\u01b0\u1edbc \u0111i kh\u00f4ng h\u1ee3p l\u1ec7! Xin vui l\u00f2ng th\u1eed l\u1ea1i!
quit = THO\u00c1T
leaveMatch = R\u1eddi kh\u1ecfi Tr\u1eadn \u0111\u1ea5u
leaveMatchQuestion = B\u1ea1n c\u00f3 ch\u1eafc b\u1ea1n mu\u1ed1n r\u1eddi kh\u1ecfi tr\u1eadn \u0111\u1ea5u hay kh\u00f4ng?
results = K\u1ebeT QU\u1ea2
gets = c\u00f3
discs = qu\u00e2n c\u1edd.
congratulations = Ch\u00fac m\u1eebng
tiedResultAnnouncement = Tr\u1eadn \u0111\u1ea5u \u0111\u00e3 k\u1ebft th\u00fac v\u1edbi t\u1ef7 s\u1ed1 h\u00f2a, nh\u01b0ng \u0111\u00f3 v\u1eabn l\u00e0 m\u1ed9t n\u1ed7 l\u1ef1c r\u1ea5t t\u1ed1t!
surrendered = \u0111\u00e3 \u0111\u1ea7u h\u00e0ng.
replay = CH\u01a0I L\u1ea0I
exit = THO\u00c1T
offlinePlayingThankYou = C\u1ea3m \u01a1n b\u1ea1n r\u1ea5t nhi\u1ec1u v\u00ec \u0111\u00e3 ch\u01a1i tr\u00f2 ch\u01a1i C\u1edd L\u1eadt c\u1ee7a t\u00f4i. T\u00f4i hy v\u1ecdng s\u1ebd \u0111\u01b0\u1ee3c g\u1eb7p l\u1ea1i b\u1ea1n v\u00e0o m\u1ed9t ng\u00e0y kh\u00f4ng xa v\u00e0 ch\u00fac b\u1ea1n c\u00f3 m\u1ed9t ng\u00e0y m\u1edbi th\u1eadt t\u1ed1t l\u00e0nh!
firstRule = 1. M\u1ed7i l\u01b0\u1ee3t ch\u01a1i bao g\u1ed3m m\u1ed9t n\u01b0\u1edbc \u0111i h\u1ee3p l\u1ec7 duy nh\u1ea5t, ho\u1eb7c \u0111\u1eb7t m\u1ed9t qu\u00e2n c\u1edd c\u1ee7a m\u00ecnh l\u00ean b\u00e0n c\u1edd ho\u1eb7c m\u1ea5t l\u01b0\u1ee3t.
secondRule = 1.1. Ng\u01b0\u1eddi ch\u01a1i hi\u1ec7n t\u1ea1i ph\u1ea3i \u0111\u1eb7t m\u1ed9t qu\u00e2n c\u1edd c\u1ee7a m\u00ecnh v\u00e0o m\u1ed9t v\u1ecb tr\u00ed c\u00f2n tr\u1ed1ng tr\u00ean b\u00e0n c\u1edd sao cho t\u1ed3n t\u1ea1i \u00edt nh\u1ea5t m\u1ed9t qu\u00e2n c\u1edd c\u1ee7a \u0111\u1ed1i th\u1ee7 b\u1ecb b\u1eaft.
thirdRule = a) C\u00e1c qu\u00e2n c\u1edd b\u1ecb b\u1eaft khi ch\u00fang b\u1ecb ch\u1eb7n hai \u0111\u1ea7u b\u1edfi m\u1ed9t qu\u00e2n c\u1edd v\u1eeba \u0111i v\u00e0 m\u1ed9t qu\u00e2n c\u1edd kh\u00e1c c\u1ee7a m\u00ecnh.
fourthRule = b) C\u00e1c qu\u00e2n c\u1edd b\u1ecb b\u1eaft ph\u1ea3i n\u1eb1m d\u1ecdc theo h\u00e0ng ngang, h\u00e0ng d\u1ecdc ho\u1eb7c h\u00e0ng ch\u00e9o.
fifthRule = 1.2. N\u1ebfu m\u1ed9t ng\u01b0\u1eddi ch\u01a1i kh\u00f4ng th\u1ec3 th\u1ef1c hi\u1ec7n m\u1ed9t n\u01b0\u1edbc \u0111i h\u1ee3p l\u1ec7, ng\u01b0\u1eddi ch\u01a1i \u0111\u00f3 m\u1ea5t l\u01b0\u1ee3t v\u00e0 l\u01b0\u1ee3t chuy\u1ec3n sang cho \u0111\u1ed1i th\u1ee7.
sixthRule = 2. N\u1ebfu c\u1ea3 hai ng\u01b0\u1eddi ch\u01a1i \u0111\u1ec1u kh\u00f4ng th\u1ec3 th\u1ef1c hi\u1ec7n m\u1ed9t n\u01b0\u1edbc \u0111i h\u1ee3p l\u1ec7, tr\u00f2 ch\u01a1i s\u1ebd k\u1ebft th\u00fac.